SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM22/Include/bgm22_rfsense.h
/* Bit fields for RFSENSE STATUS */
#define _RFSENSE_STATUS_RESETVALUE               0x00000000UL                                 /**< Default value for RFSENSE_STATUS            */
#define _RFSENSE_STATUS_MASK                     0x0FF73F1FUL                                 /**< Mask for RFSENSE_STATUS                     */
#define RFSENSE_STATUS_RFSENSEDATA               (0x1UL << 0)                                 /**< RFSENSE data input from analog              */
#define _RFSENSE_STATUS_RFSENSEDATA_SHIFT        0                                            /**< Shift value for RFSENSE_RFSENSEDATA         */
#define _RFSENSE_STATUS_RFSENSEDATA_MASK         0x1UL                                        /**< Bit mask for RFSENSE_RFSENSEDATA            */
#define _RFSENSE_STATUS_RFSENSEDATA_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_RFSENSEDATA_DEFAULT       (_RFSENSE_STATUS_RFSENSEDATA_DEFAULT << 0)   /**< Shifted mode DEFAULT for RFSENSE_STATUS     */
#define RFSENSE_STATUS_FIRSTTRIPDONE             (0x1UL << 1)                                 /**< First RFSENSE trip done                     */
#define _RFSENSE_STATUS_FIRSTTRIPDONE_SHIFT      1                                            /**< Shift value for RFSENSE_FIRSTTRIPDONE       */
#define _RFSENSE_STATUS_FIRSTTRIPDONE_MASK       0x2UL                                        /**< Bit mask for RFSENSE_FIRSTTRIPDONE          */
#define _RFSENSE_STATUS_FIRSTTRIPDONE_DEFAULT    0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_FIRSTTRIPDONE_DEFAULT     (_RFSENSE_STATUS_FIRSTTRIPDONE_DEFAULT << 1) /**< Shifted mode DEFAULT for RFSENSE_STATUS     */
#define RFSENSE_STATUS_PREAMBLEDET               (0x1UL << 2)                                 /**< Preamble Detected                           */
#define _RFSENSE_STATUS_PREAMBLEDET_SHIFT        2                                            /**< Shift value for RFSENSE_PREAMBLEDET         */
#define _RFSENSE_STATUS_PREAMBLEDET_MASK         0x4UL                                        /**< Bit mask for RFSENSE_PREAMBLEDET            */
#define _RFSENSE_STATUS_PREAMBLEDET_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_PREAMBLEDET_DEFAULT       (_RFSENSE_STATUS_PREAMBLEDET_DEFAULT << 2)   /**< Shifted mode DEFAULT for RFSENSE_STATUS     */
#define RFSENSE_STATUS_SYNCDET                   (0x1UL << 3)                                 /**< Syncword Detected                           */
#define _RFSENSE_STATUS_SYNCDET_SHIFT            3                                            /**< Shift value for RFSENSE_SYNCDET             */
#define _RFSENSE_STATUS_SYNCDET_MASK             0x8UL                                        /**< Bit mask for RFSENSE_SYNCDET                */
#define _RFSENSE_STATUS_SYNCDET_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_SYNCDET_DEFAULT           (_RFSENSE_STATUS_SYNCDET_DEFAULT << 3)       /**< Shifted mode DEFAULT for RFSENSE_STATUS     */
#define RFSENSE_STATUS_CALRUNNING                (0x1UL << 4)                                 /**< Calibration Running                         */
#define _RFSENSE_STATUS_CALRUNNING_SHIFT         4                                            /**< Shift value for RFSENSE_CALRUNNING          */
#define _RFSENSE_STATUS_CALRUNNING_MASK          0x10UL                                       /**< Bit mask for RFSENSE_CALRUNNING             */
#define _RFSENSE_STATUS_CALRUNNING_DEFAULT       0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_CALRUNNING_DEFAULT        (_RFSENSE_STATUS_CALRUNNING_DEFAULT << 4)    /**< Shifted mode DEFAULT for RFSENSE_STATUS     */
#define _RFSENSE_STATUS_CALTRIMRES_SHIFT         8                                            /**< Shift value for RFSENSE_CALTRIMRES          */
#define _RFSENSE_STATUS_CALTRIMRES_MASK          0x3F00UL                                     /**< Bit mask for RFSENSE_CALTRIMRES             */
#define _RFSENSE_STATUS_CALTRIMRES_DEFAULT       0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_CALTRIMRES_DEFAULT        (_RFSENSE_STATUS_CALTRIMRES_DEFAULT << 8)    /**< Shifted mode DEFAULT for RFSENSE_STATUS     */
#define _RFSENSE_STATUS_CALTRIMCURR_SHIFT        16                                           /**< Shift value for RFSENSE_CALTRIMCURR         */
#define _RFSENSE_STATUS_CALTRIMCURR_MASK         0x70000UL                                    /**< Bit mask for RFSENSE_CALTRIMCURR            */
#define _RFSENSE_STATUS_CALTRIMCURR_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_CALTRIMCURR_DEFAULT       (_RFSENSE_STATUS_CALTRIMCURR_DEFAULT << 16)  /**< Shifted mode DEFAULT for RFSENSE_STATUS     */
#define _RFSENSE_STATUS_CALTRIMCM_SHIFT          20                                           /**< Shift value for RFSENSE_CALTRIMCM           */
#define _RFSENSE_STATUS_CALTRIMCM_MASK           0xFF00000UL                                  /**< Bit mask for RFSENSE_CALTRIMCM              */
#define _RFSENSE_STATUS_CALTRIMCM_DEFAULT        0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_STATUS             */
#define RFSENSE_STATUS_CALTRIMCM_DEFAULT         (_RFSENSE_STATUS_CALTRIMCM_DEFAULT << 20)    /**< Shifted mode DEFAULT for RFSENSE_STATUS     */

/** @} End of group BGM22_RFSENSE_BitFields */
/** @} End of group BGM22_RFSENSE */
/** @} End of group Parts */

#endif /* BGM22_RFSENSE_H */
